<a href="https://colab.research.google.com/github/abhilashaop/ML/blob/master/pandasml.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df = pd.read_csv('http://54.166.189.131/datasets/info.csv')

In [7]:
#df
df.head(3)# to print only the top 3 rows
df.head() # prints top 5 rows by default

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [9]:
# to print a specific column
#note: the column name are case sensitive
df['Age']

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     NaN
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [10]:
# to print some specific rows and columns in a proper sequence
df.iloc[0:3,0:3]

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0

In [12]:
# to print some specific rows and columns with some breakage in the sequence
df.iloc[[3,5],[1,2]]
# to print the values 
df.iloc[[3,5],[1,2]].values

array([[3.8e+01, 6.1e+04],
       [3.5e+01, 5.8e+04]])

In [13]:
# to print the max, min, mean , average
max(df['Age'])

50.0

In [16]:
# seenging all the files of pandas
[i for i in dir(pd) if  'read'in i]

['read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table']